uploading-garmin-routes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-23 Sat 00:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Uploading Large Files to the Garmin inReach Explorer+</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Uploading Large Files to the Garmin inReach Explorer+</h1>
<p>
I was joining my friends for a section of their Catamount Trail
thru-ski down Vermont from Canada to Massachussetts. They brought a
Garmin inReach Explorer+ and wanted a map of the trail on device for
redundancy. The <a href="https://support.garmin.com/en-US/?faq=CB6pIliQmA5WINT4mR4LV7">Garmin website</a> explains how to do this:
</p>
<ol class="org-ol">
<li>Upload GPX (or KML or KMZ) file to your account on the Garmin
Explore website</li>
<li>Install inReach Sync desktop app and login with your Garmin account</li>
<li>Connect inReach to computer via USB and use inReach Sync to sync
the uploaded file from account to device</li>
</ol>

<p>
I downloaded the GPX files from the <a href="https://catamounttrail.org/ski-the-trail/faq/staying-found/">Catamount Trail website</a> and found
I could upload to Garmin as "tracks" or "routes". When I tried
uploading as route, I found the upload to be much more coarse than the
original GPX file (far fewer waypoints). But uploading as a "track"
wasn't even usable for navigating. The Garmin website said about
routes: "Any line will be reduced to 200 data points." I couldn't find
anything else from Garmin about specific file constraints so I started
experimenting to get the map on the device in full resolution.
</p>

<div id="outline-container-orgb6d18d5" class="outline-2">
<h2 id="orgb6d18d5">GPX Background</h2>
<div class="outline-text-2" id="text-orgb6d18d5">
<p>
GPX is just an XML schema. It can represent things like a "route", which
is a series of points to be followed, and a "track", which is a series
of points (optionally timestamped) representing a journey taken:
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;gpx version="1.0" creator="GPSBabel - https://www.gpsbabel.org" xmlns="http://www.topografix.com/GPX/1/0"&gt;
  &lt;time&gt;2022-01-13T18:37:13.323Z&lt;/time&gt;
  &lt;bounds minlat="42.739060000" minlon="-72.945140000" maxlat="42.801320000" maxlon="-72.910070000"/&gt;
  &lt;trk&gt;
    &lt;trkseg&gt;
      &lt;trkpt lat="42.739060000" lon="-72.925210000"/&gt;
      &lt;trkpt lat="42.740510000" lon="-72.923980000"/&gt;
      &lt;trkpt lat="42.740640000" lon="-72.923910000"/&gt;
      &lt;trkpt lat="42.740640000" lon="-72.923910000"/&gt;
      &lt;trkpt lat="42.740920000" lon="-72.923760000"/&gt;
    &lt;/trkseg&gt;
  &lt;/trk&gt;
&lt;/gpx&gt;
</pre>
</div>
<p>
The GPX file from the trail association had a single track, with a
single track segment, with about 17,000 points over ~300 miles (one
waypoint every ~100 feet). Even though the file contained a track, it
could still be uploaded as a route to Garmin.
</p>
</div>
</div>

<div id="outline-container-org58626e0" class="outline-2">
<h2 id="org58626e0">Splitting the GPX file</h2>
<div class="outline-text-2" id="text-org58626e0">
<p>
I looked for a tool to split a GPX file into smaller parts. I found
lots of software that I couldn't get to work:
</p>
<ul class="org-ul">
<li><a href="https://sites.google.com/site/gpxtracksplitter/">gpxtracksplitter</a> (windows)</li>
<li><a href="http://iamdanfox.github.io/gpxsplitter/">gpxsplitter</a> (web app)</li>
<li>Lots of repos on github</li>
</ul>

<p>
But then a <a href="https://gis.stackexchange.com/questions/193168/how-to-split-a-gpx-track-file-into-several-files-of-n-trackpoints-each">post on the GIS stackexchange</a> explained how to do it with
<a href="http://gpsbabel.org">gpsbabel</a>:
</p>

<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash

# $1 shall be the gpx file to split
pfx="${1%.*}-"
gpsbabel -i gpx -f "$1" -t -o csv -F - \
| gsplit -d -l 200 --additional-suffix=.csv - "$pfx"

for f in "$pfx"*.csv; do
    fout=${f%.*}.gpx
    gpsbabel -i csv -f "$f" -x transform,trk=wpt -x nuketypes,waypoints \
                        -o gpx -F "$fout"
    rm "$f"
done
</pre>
</div>

<p>
It converts the GPX to a CSV, chunks the CSV into smaller CSVs, then
converts each CSV back to GPX.
</p>

<p>
So now instead of one GPX with 17,000 points in a single track
segment, I had 86 GPXs, each with a single track of 200 points. They
could be losslessly uploaded to Garmin as routes, but I would have to
upload them by hand.
</p>
</div>
</div>

<div id="outline-container-orgbfe94e0" class="outline-2">
<h2 id="orgbfe94e0">Concatenating the smaller files</h2>
<div class="outline-text-2" id="text-orgbfe94e0">
<p>
I've been doing a lot of functional programming lately, so I used a
"fold" to accumulate the output GPXs into a single file (yikes):
</p>

<div class="org-src-container">
<pre class="src src-bash">#!/bin/bash

# $1 is input
# $2 is output
# $3 is (optionally) max number of points per file

prefix="${1%.*}-"
gpsbabel -i gpx -f "$1" -t -o csv -F - \
  | gsplit -d -l ${3:-200} --additional-suffix=.csv - "$prefix"

echo -e "&lt;?xml version=\"1.0\" ?&gt;\n&lt;gpx&gt;\n&lt;/gpx&gt;" &gt; "$2"
for f in "$prefix"*.csv; do
    gpsbabel -i csv -f "$f"                              \
             -i gpx -f "$2"                              \
             -x transform,trk=wpt -x nuketypes,waypoints \
             -o gpx -F "$2"
    rm "$f"
done
</pre>
</div>

<p>
There is definitely a better way but this one worked. A single GPX
with 86 tracks, each with a single segment of 200 points. It may be
that 1 track of 86 segments would work too.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>hi</p>
</div>
</body>
</html>
